# ано список [-2, 0, 4, 12, 0]. Необхідно змінити його, збільшивши кожне значення на 5
# a=[-2, 0, 4, 12, 0]
# b=[]
# for i in a:
#     i+=5
#     print(i)
#     b.append(i)
#     print(b)
# 
# 

# print("hello")
# input()
# a = []
# a.append()

#
# def <ім'я функції>([список аргументів]):
#     оператор 1
#     оператор 2
#     ...
#     оператор N

# # def sayHello():
# #     print("hello")

# sayHello()

# def mnozhenna(x):
#     print(x*x)
# mnozhenna(5) # ---- x = 5 

# x = 5
# def ddd():
#     global x
#     x +=5
#     print(x)
# ddd()
# # print(x)

# def getSquare(w,h):
#     return w*h
# print(getSquare(10,5))

# 4. Напишіть функцію під назвою calculate_rectangle_area, яка приймає два аргументи -
# довжину і ширину прямокутника, а повертає його площу. Використайте цю функцію
# для обчислення площі прямокутника зі сторонами 4 і 5 і виведіть результат.
# def calculate_rectangle_area(w,h):
#     area = w*h
#     return area
# print(calculate_rectangle_area(4,5))
# 5. Напишіть функцію print_info, яка приймає два аргументи: name (ім'я) і age (вік).
# Функція повинна вивести на екран повідомлення, що містить інформацію про особу,
# наприклад, "Мене звати Анна, мені 25 років". Викличте функцію зі своїми власними
# значеннями для name і age.
# def print_info(name,age):
#     a = f"Мене звати {name}, мені {age} років"
#     print(a)
# print_info("Олег","30") #  name = "Олег" , age = "30"
# 6. Міста: напишіть функцію describe_city(), яка отримує назви міста та країни. Функція
# має виводити просте повідомлення (наприклад, "Reykjavik is in Iceland"). Задайте
# параметру країни значення за замовчуванням. Викличте свою функцію для трьох
# різних міст, принаймні принаймні одне з яких не розташоване в країні за
# замовчуванням.
# def escribe_city(city,country):
#     a=f"мое місто {city}, моя країна {country}"
# escribe_city("Львів","Україна")
# 3. Описати функцію PowerA3(A), що обчислює третій степінь числа A і повертає його у
# змінну B
def PowerA3(A):
    b=A**3
    return b
print(PowerA3(10))