# Користувач вводить колір світлофора ("червоний", "жовтий", "зелений").
# Програма виводить:
# Червоний → "Стій!"
# Жовтий → "Приготуйся!"
# Зелений → "Йди!"
# Інший текст → "Невідомий колір".
# while True:
#     color = input("Введіть колір світлофора").lower()
#     if color == "червоний":
#         print("Стій")
#         break
#     elif color == "Жовтий":
#         print("Приготуйся")
#         break
#     elif color == "Зелений":
#         print("Йди")
#         break
#     else:
#         print("Введіть кореткно")
# Користувач вводить номер місяця (1–12).
# Програма визначає пору року:
# 12, 1, 2 → Зима
# 3, 4, 5 → Весна
# 6, 7, 8 → Літо
# 9, 10, 11 → Осінь
# Якщо число не 1–12 → повідомити про помилку.
month=int(input("введіть номер місця (1-12):" ))
if month==12 or month==1 or month==2:
    print("зима")
elif month==3 or month==4 or month==5:
    print("весна")
elif month==6 or month==7 or month==8:
    print("літо")
elif month==9 or month==10 or month==11:
    print("осінь")  
else:
    