# input
 #input - він дозволяє нам писати текст в консоль 
# a=input("Введіть число: ")
# print(a)
# arrow = input("Скільки стріл ми запустили?")
# print("Ми запустили", arrow,"стріл")
# a=int( input("Введіть число: ")) # float
# b=float( input("Введіть число: ")) # int
# c=a-b 
# print(c)
# print(type(c))
#name = input("Введіть ваше ім'я: ")
#print("Мене звати ",name)
# name = "Sasha"
a= input("привіт як дела")
print("в мене тоже",a)
b= input("що ти робиш")
print("круто я теж ",b)
r= input("скільки тобі років")
print("мені теж ",r)
z= input("в якій ти в школі навчаєшся")
print("ого ти в 7",z,"а я в 8")
x= input ("чим ти любиш займатися")
print("я теж займаюсь",x) 
m= input ("а ти дивишся ютубера холдіка")
print("я теж ",m, "дивлюся")
c= input ("а ти граєш в роблокс")
print("я теж граю" "а якій ти режим любиш", c)
p= input("в якій ти області живеш")
print("а я живу в Запорійскій області")