# ; 4. Напиши функцію, яка повертає найбільше число зі списку. Вона повинна мати один
# ; іменований аргумент: numbers (список чисел).
# 1. Напиши функцію, яка приймає два аргументи: name і age. Вона повинна вивести
# повідомлення, що містить ім'я та вік, використовуючи іменовані аргументи.
# 4. Напиши функцію, яка повертає найбільше число зі списку. Вона повинна мати один
# іменований аргумент: numbers (список чисел).  

# def findmax(numbers):
#     return max(numbers)
# a = [5,2,5,3,5,7,8,3,3,6,8,5]
# findmax([5,2,5,3,5,7,8,3,3,6,8,5])
# print(findmax([5,2,5,3,5,7,8,3,3,6,8,5]))
# print(findmax(numbers=a))
# [[1,2,3],[4,5,6],[7,8,9]]

# 5. Напиши функцію, яка перевіряє, чи є рядок паліндромом без урахування регістру
# (букви великі або малі). Вона повинна мати один іменований аргумент: string
# (рядок).


# def паліндром(string):
#     text = string.lower()
#     textreverse = text[::-1]
#     return text == textreverse
# textik = input("Введіть текст для перевірки паліндрому ")
# print(паліндром(string=textik))


# 9. Напиши функцію, яка повертає суму чисел зі списку, якщо він не порожній. Якщо
# список порожній, функція повертає нуль. Функція повинна мати один необов'язковий
# параметр: numbers (список чисел)

# def сумасписку(numbers=[]):
#     if numbers:
#         return sum(numbers)
#     else:
#         return 0
# print(сумасписку())
# print(сумасписку([1,2,3,4]))
# print(сумасписку([99,-99,1]))


# print("тут могла бути ваша функція"(name="Ярік",age=100))
# def pushka(name age):
#     print("мене звати",name,"і мені",age,"років")
#     pushka(name="pushkarik",age=12)
# def pushkarik(gam1="standof2",game2="geometry Dash",game3="roblox"):
#    print(  f"мої улюблені гри",gam1,game2,game3) 
# pushkarik()
# 7. Назви міст: напишіть функцію city_country(), яка отримує назву міста та країну.
# Функція має повертати рядок у форматі "Santiago, Chile". Викличте свою функцію
# принаймні для трьох пар "місто - країна" і виведіть повернене значення
def city_country(city,country):
    return city+","+country
print("країни")