#скількі знадобиться грошей щоб задонатити в  роблокс
# a= int(input("введіть робукси"))
# b= int(input("введіть скікі ви донатили раз в день"))
# s=0
# i=0
# while s<a:
#     s+=b
#     print(" ви донатили",s)
#     i+=1
#     print("скількі ви заходили",i)

#скількі разів треба накопити грошей щоб купити телевізор
 # int(input("введіть скількі вас грошей"))
#b=int(input("скількі ми накопуємо"))
#s=0
#i=0
#c=10000
#while a<c:
#    a+=b
#    i+=1
 #   print("скількі")
#скільки нривень треба щоб купити весь магазин
"""
Цей код створює Міні-калькулятор,
який дозволяє користувачеві виконувати прості арифметичні операції -
додавання, віднімання, множення та ділення з двома числами.
Користувач може вибрати бажану операцію, ввести два числа, і результат операції буде виведений на екран.
Також є опція "Exit" (вихід) для того, щоб користувач міг завершити роботу з калькулятором.
"""
while True:
    print(" виберіть операцію")
    print("1 додати")
    print("2 відняти")
    print("3помножити")
    print("4 поділити")
    a=int(input("ввиберіть операцію"))  
    b=int(input("введіть число"))
    n=int(input("введіть друге число"))
    if  a==1:
        print(b+n)
    elif a==2:
        print(b-n)
    elif a==3:
        print(b*n)
    elif a==4:
       print (b/n)
    elif a==5:
        break
    else:
        print("помилка")
        # Умовні оператори 
# > < <= >= , , , , , , , == , !=
# if - означає якщо
#if a == 5 : - двокрапка обов'язкова після умови 
# == - дорівнює
# != - не дорівнює
# > - більше 
# < - менше
# <= - менше рівне
# >= - більше рівне
if #умова:
    #будь який блок коду
#якщо хочемо написати другу умову
elif #друга умова:
    #будь який блок коду
# якщо хочемо сказати будь яка інша умова
else:
    #будь який блок коду