# 5. Дано три цілих числа. Визначте, скільки серед них таких, що збігаються. Програма
# має вивести одне з чисел: 3 (якщо всі збігаються), 2 (якщо два збігаються) або 0
# (якщо всі числа різні).
# a=int(input("введіть перше число"))
# b=int(input("введіть друге число"))
# c=int(input("введіть третє число"))
# if a==b==c:
#     print(3)
# elif a==b or b==c or a==c:
#     print(2)
# else:
#     print(0)
#  Вводиться дійсне число. Потрібно визначити, що його ціла частина кратна 2.
# 4. Вивести на екран числа від -10 до 10 за допомогою циклу while
# x=int(input("введи дійсне число"))
# if int(x) % 2 == 0:
#     print("ціла частина кратна 2")
# else:
#     print("ціла частина не кратна 2")
# 12. Вводяться два цілих числа. Визначити, чи діляться вони націло одне на одне.
# Якщо діляться, то вивести результат їхнього ділення
a=int(input("введи число"))
b=int(input("введи друге число"))
if b != 0 and a % b == 0:
    print(f"{a} ділиться на {b}, результат: {a // b}")
elif a != 0 and b % a == 0:
    print(f"{b} ділиться на {a}, результат: {b // a}")
else:
    print("Числа не діляться одне на одне націло")