# str1 = "Hello"
# str2 = "World"
# str3 = """Hello
# zdsd
# dfefkw
# grjfkjw
# gjfjkwefnjkwe
# djfwekfwejkfbn
# World""" 
# str4 ='''
# print(str3)
# print(type(str1))
# print(type(str2))
# '''
# str5 = str1 + " " + str2 
# print(str5)

# a= "5"
# b= "5"
# print(a+b)

# a = "ой"
# print(a*100) # Множити можна лише на цілі числа 
# ----------------------------- Функція len() --------------------------------
#len() # Ця функція дозволяє нам дізнатись кількість символів в рядку
# a = "Bibi"
# b = len(a)
# print(b)
# print(type(b))
# if b < 8 :
#     print("Пароль закороткий")

# # ----------- Оператор in ----------------
# s = "abcdefg0123"
# print("@ , # < % & * " in s)
# if "@ , # < % & * " not in s:
#     print("немає спецсимволів")


# ============================ H E L L O Індекси ==============================
# Перша буква має індекс 0 [0]
#Остання буква має індекс [-1]
# a = "Іван"
# b = "Іванович"
# print(a[0],".",b)


# ======================== Зрізи ======================

# #msg = "Hello World! 32532523e32e8923745982345"
# msg = "Hello World!"
# print(msg[6:11]) # World
# print(msg[2:5]) # llo
# print(msg[:5]) # Hello
# print(msg[6:]) # World! 32532523e32e8923745982345
# print(msg[:]) #  Hello World! 32532523e32e8923745982345
# print(msg[-5:-1]) # 8234
# print(msg[1:9:2]) # Перший індекс , останній індекс , крок 
# print(msg[1:-9:-1])
# print(msg[::-1]) # Перевернутий рядок  !dlroW olleH

#==========================Методи рядків===============================
# a = "Hello World!"
# a.upper()
# print(a)
# b = a.upper()
# print(b)
# c = b.lower()
# print(c)
# d = input().lower()
# print(d)
# print(" Напишіть так якщо погоджуєтесь з нашими правилами")
# a=input().capitalize()
# print(a)
# if a == "Так":
#     print("Вітаю! ви погодились")

# msg = "abrakadabra"
# b= msg.count("ra")
# print(b)
# print(type(b))
# Користувач вводить годину (ціле число від 0 до 23).
# Програма визначає:

# якщо година від 6 до 11 → "Доброго ранку!"

# якщо від 12 до 17 → "Добрий день!"

# якщо від 18 до 22 → "Добрий вечір!"

# якщо від 23 до 5 → "Доброї ночі!"

# if hours < 0 and hours >=24:
#     print("Введіть корректну годину")
# else:
# hours = 1
# while hours >=0 and hours <= 23:
#     hours = int(input("Введіть годину: (0-23)"))
#     if hours >=6 and hours <= 11:
#         print("Доброго ранку")
#     elif hours >=12 and hours <= 17:
#         print("Добрий день")
#     elif hours >=18 and hours <= 22:
#         print("Добрий вечір")
#     else:
#         print("Доброї ночі")
# print("Ви ввели не корректну годину!")

# Задача: Автомат з напоями

# Умова:
# Користувач вводить номер напою:

# 1 → «Кава — 30 грн»

# 2 → «Чай — 25 грн»

# 3 → «Сік — 40 грн»

# 4 → «Вода — 15 грн»

# Якщо ввели інший номер → вивести "Такого напою немає".

# print("1. Кава — 30 грн")
# print("2. Чай — 25 грн")
# print("3. Сік — 40 грн")
# print("4. Вода — 15 грн")
# print("Зробіть свій вибір (виберіть цифру від 1 до 4 включно)")
# choice = int(input("Оберіть цифру 1-4 "))
# if choice == 1:
#     print("Кава — 30 грн. Смачного!")
# elif choice == 2:
#     print("Чай — 25 грн. Смачного!")
# elif choice == 3:
#     print("Сік — 40 грн. Смачного!")
# elif choice == 4:
#     print("Вода — 15 грн. Смачного!")
# else:
#     print("Такого напою немає, зробіть корректний вибір!")

# Задача: Пароль

# Умова:
# Система має збережений пароль "python123".
# Користувач повинен вводити пароль доти, поки не введе правильно.
# Правила:

# Якщо введений пароль неправильний → вивести "Невірний пароль, спробуй ще раз".

# Якщо правильний → вивести "Доступ дозволено ✅" і завершити програму.

# password = "python123"
# attempt = ""
# while password != attempt:
#     attempt = input("Введіть пароль: ")
#     if password != attempt:
#         print("Невірний пароль, спробуйте ще раз!")
# print("Доступ дозволено ✅")

# Умова:
# Користувач хоче назбирати певну суму грошей (мета).
# Програма у циклі while питає, скільки він поклав у скарбничку цього разу, і додає цю суму.
# Цикл триває, доки накопичена сума не досягне або не перевищить мету.
# Після цього програма виводить:

# "Мета досягнута!"

# скільки грошей вийшло в сумі

# скільки разів довелося класти гроші.


goal = int(input("Яку суму хочеш назбирати "))
total = 0
count = 0
while goal>total:
    deposit = int(input("Скільки кладемо в скарбничку цього разу? "))
    total += deposit
    count += 1
print("Мета досягнута!")
print(f"Всього назбирано {total} грн")
print(f"Кількість внесень в скарбничку {count}")