 # ----- Оператори присвоєння       
# = Призначити значення змінній 
# += Додавання значення з правого боку до лівої частини і потім призначити значення суми  
# a = 10
# a += 5
# print(a)
# # -= Віднімання значення з правого боку до лівої частини і потім призначити значення різниці
# a = 6
# a -= 2
# print(a)
# # *= Помноження значення з правого боку до лівої частини і потім призначити значення добутку
# a = 2
# a *= 3
# print(a)
# # /= Ділення значення з правого боку до лівої частини і потім призначити значення частки
# a = 10
# a /= 2
# print(a)
# #. // Ділення значення з правого боку до лівої частини і потім призначити значення частки
# a = 10
# a //= 4
# print(a)
# # % Ділення з часткою та присвоєння 
# a = 10
# a %= 3
# print(a)
# # ** Піднесення до степеня
# a = 2
# a **= 3
# print(a)
# # != Нерівність
# # > Більше
# # < Менше
# # >= Більше або рівне
# # <= Менше або рівне
# # Bool? True False  усі оператори порівняння несуть в собі True або False 
# a = 10
# b = 10
# print(a == b)
# print(a != b)
# print(a > b)
# print(a < b)
# print(a >= b)
# print(a <= b
# and логічне і 
# or логічне або
# not логічне ні 
# a = True
# b = False
# print(a and b)
# print(a or b)
# print(not a)
# # - 2 до 5 включно 
# y = 1.95
# print(y>=-2 and y<=5)
# a = "Hello, World!"
# print("Hello" in a)
# # print("Python" in a)

# # ----- Функція round -----
# a = 3.141592653589793
# print(round(a, 2))
# 12.Напишіть програму, в яку вводиться кількість днів у році і програма пише високосний він чи ні
# Високосний рік це в нас 366 днів
# Звичайний рік це 365 
# Вводиться - це означає що ми маємо написати значення в терміналі або консолі або знизу в пайтоні11.Напишіть програму, яка