# Домашнє завдання: Одну з задач з If ви виконуєте в інтерфейсі tkinter , на вибір виконайте 2-3 задачі if і 2 задачі з функціями 
# Задачі з if 
# 5. Перевірка діапазону
# Завдання: Визначити, чи знаходиться число в діапазоні від -4 до 10 включно.
# Опис: Програма перевіряє, чи одночасно виконуються дві умови: число не менше -4 і не більше 10. Якщо обидві умови істинні, виводиться відповідне повідомлення.

# 6. Порівняння з нулем
# Завдання: Визначити, чи є число додатним або від'ємним.
# Опис: Програма порівнює введене число з нулем. Якщо воно менше нуля, вона повідомляє, що число від'ємне. В іншому випадку вона повідомляє, що воно позитивне.

# 7. Визначення високосного року
# Завдання: Перевірити, чи є рік високосним.
# Опис: Програма використовує правила григоріанського календаря: рік є високосним, якщо він ділиться на 4, але не на 100, або якщо він ділиться на 400.

# 8. Визначення дня тижня
# Завдання: Вивести назву дня тижня, що відповідає числу від 1 до 7.
# Опис: Програма перевіряє, яке число ви ввели, і виводить відповідну назву дня тижня. Наприклад, якщо ви вводите 1, виводиться "Понеділок". Якщо число не в діапазоні від 1 до 7, виводиться повідомлення про помилку.

# 9. Керування світлофором
# Завдання: Визначити колір світлофора для пішоходів у певний момент часу.
# Опис: Програма моделює роботу світлофора, де зелене світло горить 3 хвилини, а червоне – 2 хвилини. Вона використовує остачу від ділення часу на 5, щоб визначити, в якій частині 5-хвилинного циклу знаходиться поточний час і який колір горить.

# Функції 
# 2. Повідомлення: напишіть функцію display_message() для виведення повідомлення
# за темою, розглянутою в цьому розділі. Викличте функцію і переконайтеся в тому,
# що повідомлення виводиться правильно.

# 3. Улюблена книга: напишіть функцію favorite_book(), яка отримує один параметр title.
# Функція має виводити повідомлення виду "One of my favorite books is Alice in
# Wonderland". Викличте функцію і переконайтеся в тому, що назву книги правильно
# передають як аргумент під час виклику функції.
year = int(input("Введіть рік: "))
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print("Рік високосний")
else:
    print("Рік не високосний")